{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 5, 1], "name": "input1", "sparse": false}, "inbound_nodes": [], "name": "input1"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 11, 1], "name": "input2", "sparse": false}, "inbound_nodes": [], "name": "input2"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAABAAAAFMAAABzFgAAAHQAAGoBAGoCAHwAAGQBAGQCAIMBAVMoAwAAAE50BAAAAGF4\naXNp/////ygDAAAAdAUAAABrZXJhc3QHAAAAYmFja2VuZHQHAAAAc3F1ZWV6ZSgBAAAAdAEAAAB4\nKAAAAAAoAAAAAHMLAAAAYmFja19lbmQucHl0CAAAADxsYW1iZGE+JQAAAHQAAAAA\n", null, null], "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["input1", 0, 0, {}]]], "name": "lambda_1"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAABAAAAFMAAABzFgAAAHQAAGoBAGoCAHwAAGQBAGQCAIMBAVMoAwAAAE50BAAAAGF4\naXNp/////ygDAAAAdAUAAABrZXJhc3QHAAAAYmFja2VuZHQHAAAAc3F1ZWV6ZSgBAAAAdAEAAAB4\nKAAAAAAoAAAAAHMLAAAAYmFja19lbmQucHl0CAAAADxsYW1iZGE+JQAAAHQAAAAA\n", null, null], "name": "lambda_2", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["input2", 0, 0, {}]]], "name": "lambda_2"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 42, 1], "name": "input3", "sparse": false}, "inbound_nodes": [], "name": "input3"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_1", "dtype": "float32", "output_dim": 16, "trainable": true, "embeddings_regularizer": null, "input_dim": 37, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 5], "activity_regularizer": null, "input_length": 5}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "name": "embedding_1"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_2", "dtype": "float32", "output_dim": 16, "trainable": true, "embeddings_regularizer": null, "input_dim": 94, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 11], "activity_regularizer": null, "input_length": 11}, "inbound_nodes": [[["lambda_2", 0, 0, {}]]], "name": "embedding_2"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAABAAAAFMAAABzFgAAAHQAAGoBAGoCAHwAAGQBAGQCAIMBAVMoAwAAAE50BAAAAGF4\naXNp/////ygDAAAAdAUAAABrZXJhc3QHAAAAYmFja2VuZHQHAAAAc3F1ZWV6ZSgBAAAAdAEAAAB4\nKAAAAAAoAAAAAHMLAAAAYmFja19lbmQucHl0CAAAADxsYW1iZGE+JQAAAHQAAAAA\n", null, null], "name": "lambda_3", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["input3", 0, 0, {}]]], "name": "lambda_3"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1175, 1], "name": "input4", "sparse": false}, "inbound_nodes": [], "name": "input4"}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "lstm_1", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "lstm_1"}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "lstm_2", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "name": "lstm_2"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_3", "dtype": "float32", "output_dim": 16, "trainable": true, "embeddings_regularizer": null, "input_dim": 1378, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 42], "activity_regularizer": null, "input_length": 42}, "inbound_nodes": [[["lambda_3", 0, 0, {}]]], "name": "embedding_3"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAABAAAAFMAAABzFgAAAHQAAGoBAGoCAHwAAGQBAGQCAIMBAVMoAwAAAE50BAAAAGF4\naXNp/////ygDAAAAdAUAAABrZXJhc3QHAAAAYmFja2VuZHQHAAAAc3F1ZWV6ZSgBAAAAdAEAAAB4\nKAAAAAAoAAAAAHMLAAAAYmFja19lbmQucHl0CAAAADxsYW1iZGE+JQAAAHQAAAAA\n", null, null], "name": "lambda_4", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["input4", 0, 0, {}]]], "name": "lambda_4"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "inbound_nodes": [[["lstm_1", 0, 0, {}], ["lstm_2", 0, 0, {}]]], "name": "concatenate_1"}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "lstm_3", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null}, "inbound_nodes": [[["embedding_3", 0, 0, {}]]], "name": "lstm_3"}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_4", "dtype": "float32", "output_dim": 16, "trainable": true, "embeddings_regularizer": null, "input_dim": 96246, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 1175], "activity_regularizer": null, "input_length": 1175}, "inbound_nodes": [[["lambda_4", 0, 0, {}]]], "name": "embedding_4"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_2", "axis": -1}, "inbound_nodes": [[["concatenate_1", 0, 0, {}], ["lstm_3", 0, 0, {}]]], "name": "concatenate_2"}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "lstm_4", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null}, "inbound_nodes": [[["embedding_4", 0, 0, {}]]], "name": "lstm_4"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_3", "axis": -1}, "inbound_nodes": [[["concatenate_2", 0, 0, {}], ["lstm_4", 0, 0, {}]]], "name": "concatenate_3"}, {"class_name": "Reshape", "config": {"target_shape": [-1, 1], "trainable": true, "name": "reshape_1"}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "name": "reshape_1"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 1], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_4", "axis": 1}, "inbound_nodes": [[["reshape_1", 0, 0, {}], ["input_1", 0, 0, {}]]], "name": "concatenate_4"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "batch_normalization_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "dense_2"}], "input_layers": [["input1", 0, 0], ["input2", 0, 0], ["input3", 0, 0], ["input4", 0, 0], ["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}